----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 32, 32, 32]             864
              ReLU-2           [-1, 32, 32, 32]               0
       BatchNorm2d-3           [-1, 32, 32, 32]              64
           Dropout-4           [-1, 32, 32, 32]               0
            Conv2d-5           [-1, 64, 32, 32]          18,432
              ReLU-6           [-1, 64, 32, 32]               0
       BatchNorm2d-7           [-1, 64, 32, 32]             128
           Dropout-8           [-1, 64, 32, 32]               0
            Conv2d-9           [-1, 32, 32, 32]           2,048
           Conv2d-10           [-1, 32, 30, 30]             288
           Conv2d-11           [-1, 32, 30, 30]           1,024
             ReLU-12           [-1, 32, 30, 30]               0
      BatchNorm2d-13           [-1, 32, 30, 30]              64
          Dropout-14           [-1, 32, 30, 30]               0
           Conv2d-15           [-1, 32, 28, 28]             288
           Conv2d-16           [-1, 32, 28, 28]           1,024
             ReLU-17           [-1, 32, 28, 28]               0
      BatchNorm2d-18           [-1, 32, 28, 28]              64
          Dropout-19           [-1, 32, 28, 28]               0
           Conv2d-20           [-1, 32, 26, 26]             288
           Conv2d-21           [-1, 32, 26, 26]           1,024
             ReLU-22           [-1, 32, 26, 26]               0
      BatchNorm2d-23           [-1, 32, 26, 26]              64
          Dropout-24           [-1, 32, 26, 26]               0
           Conv2d-25           [-1, 16, 22, 22]           4,624
             ReLU-26           [-1, 16, 22, 22]               0
           Conv2d-27           [-1, 16, 20, 20]             144
           Conv2d-28           [-1, 32, 20, 20]             512
             ReLU-29           [-1, 32, 20, 20]               0
      BatchNorm2d-30           [-1, 32, 20, 20]              64
          Dropout-31           [-1, 32, 20, 20]               0
           Conv2d-32           [-1, 32, 18, 18]             288
           Conv2d-33           [-1, 64, 18, 18]           2,048
             ReLU-34           [-1, 64, 18, 18]               0
      BatchNorm2d-35           [-1, 64, 18, 18]             128
          Dropout-36           [-1, 64, 18, 18]               0
           Conv2d-37           [-1, 64, 16, 16]             576
           Conv2d-38           [-1, 64, 16, 16]           4,096
             ReLU-39           [-1, 64, 16, 16]               0
      BatchNorm2d-40           [-1, 64, 16, 16]             128
          Dropout-41           [-1, 64, 16, 16]               0
           Conv2d-42             [-1, 64, 7, 7]          36,928
             ReLU-43             [-1, 64, 7, 7]               0
           Conv2d-44             [-1, 16, 7, 7]           1,024
           Conv2d-45             [-1, 32, 5, 5]           4,608
             ReLU-46             [-1, 32, 5, 5]               0
      BatchNorm2d-47             [-1, 32, 5, 5]              64
          Dropout-48             [-1, 32, 5, 5]               0
           Conv2d-49             [-1, 64, 3, 3]          18,432
        AvgPool2d-50             [-1, 64, 1, 1]               0
           Conv2d-51             [-1, 10, 1, 1]             640
================================================================
Total params: 99,968
Trainable params: 99,968
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 8.11
Params size (MB): 0.38
Estimated Total Size (MB): 8.50
----------------------------------------------------------------
